_sdaiHeaderName(Sdai_instS*)
\details
Retrieves the file name instance of the specified repository's header section.
\param repository [in] A repository to get the instance from.
\returns A file name instance of the repository's header section.